package ru.otus.descriptions;

public interface DescNavigatePanel {

    String changeInterfaceLang =
            "Действия:\n" +
                    "1. Кликнуть на иконку \"Земного шара\" \n" +
                    "2. Кликнуть на радио-баттон \"Английский\" в разделе интерфейса \n" +
                    "3. Кликнуть \"Сохранить\" \n\n" +

            "Ожидаемый результат: \n" +
                    "1. Язык интерфейса изменен \n";

    String checkLoginBtn =
            "Действия:\n" +
                    "1. Кликнуть на кнопку \"Вход\" \n\n" +

            "Ожидаемый результат: \n" +
                    "1. Открылась страница авторизации \n";

    String checkRegBtn =
            "Действия:\n" +
                    "1. Кликнуть на кнопку \"Регистрация\" \n\n" +

                    "Ожидаемый результат: \n" +
                    "1. Открылась страница регистрации \n";

}
